src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <comment>(ВКМ) ДОБАВЛЕНИЕ, Самжилин Д.Р., 06.08.2026</comment>
  <registerRecords>AccumulationRegister.ВКМ_НачислениеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	МассивСтрок = Новый Массив;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Струк = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания", Строка.Сотрудник, Строка.ДатаНачала,
		Строка.ДатаОкончания);
		МассивСтрок.Добавить(Струк);
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(МассивСтрок);
	
	СтрукПараметров = Новый Структура("АдресВХ", Адрес);
	СтрукПараметров.Вставить("Дата", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтрукПараметров, ЭтаФорма, , , , , );
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверитьДлительностьОтпусков();
КонецПроцедуры

&НаСервере
Процедура ПроверитьДлительностьОтпусков()
	
	УсловноеОформление.Элементы.Очистить();
	
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
	
	МесяцВСекундах = 60*60*24*28;
		
	Отбор = Новый Структура;
    Отбор.Вставить("Сотрудник", Строка.Сотрудник);
    Строки = ТЗ.НайтиСтроки(Отбор);
    
    РазницаСекунд = 0;
    
    	Для Каждого Стр Из Строки Цикл
        	РазницаСекунд = РазницаСекунд + (Стр.ДатаОкончания - Стр.ДатаНачала);
    	КонецЦикла;
    	
    	Если РазницаСекунд > МесяцВСекундах Тогда
    		ИзменитьЦвет(Строка.НомерСтроки);
    	КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦвет(Номер)
    
    ЦветОформление = УсловноеОформление.Элементы.Добавить();   
    
    ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
    
    ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
    
    ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.НомерСтроки");
    ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОформления.ПравоеЗначение = Номер;   
    ЭлементОформления.Использование = Истина; 
    
    ПолеЭлемента = ЦветОформление.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтпускаСотрудников.Имя); 
    ПолеЭлемента.Использование = Истина;  
    
    Элементы.ОтпускаСотрудников.Обновить();
    
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПроверитьДлительностьОтпусков();
КонецПроцедуры
